2) /var/www/html/src/Compiler/Builder/ArrayInitialisationPreconditionBuilder.php:26    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getNode() : Node
     {
-        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), ['stmts' => [new Node\Stmt\Expression(new Node\Expr\Assign($this->pathNode, new Node\Expr\Array_([], ['kind' => Node\Expr\Array_::KIND_SHORT])))]]);
+        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([])), ['stmts' => [new Node\Stmt\Expression(new Node\Expr\Assign($this->pathNode, new Node\Expr\Array_([], ['kind' => Node\Expr\Array_::KIND_SHORT])))]]);
     }
 }

24) /var/www/html/src/Compiler/Builder/PropertyPathBuilder.php:32    [M] NotIdentical

--- Original
+++ New
@@ @@
         if ($this->limit < 0) {
             $iterator = new \LimitIterator($iterator, 0, iterator_count($iterator) + $this->limit);
         } else {
-            if ($this->limit !== null) {
+            if ($this->limit === null) {
                 $iterator = new \LimitIterator($iterator, 0, $this->limit);
             }
         }

27) /var/www/html/src/Compiler/Builder/PropertyPathBuilder.php:36    [M] Foreach_

--- Original
+++ New
@@ @@
                 $iterator = new \LimitIterator($iterator, 0, $this->limit);
             }
         }
-        foreach ($iterator as $index => $child) {
+        foreach (array() as $index => $child) {
             if ($this->propertyPath->isIndex($index)) {
                 $pathNode = new Node\Expr\ArrayDimFetch($pathNode, new Node\Scalar\String_($child));
             } else {

51) /var/www/html/src/FieldConcatCopyValuesMapper.php:59    [M] UnwrapArrayMap

--- Original
+++ New
@@ @@
      */
     public function compile() : array
     {
-        $inputPaths = array_map(function (string $path) {
-            return new PropertyPath($path);
-        }, $this->inputFields);
+        $inputPaths = $this->inputFields;
         $outputPath = new PropertyPath($this->outputField);
         $nodes = array_merge(array_map(function (PropertyPath $path) {

52) /var/www/html/src/FieldConcatCopyValuesMapper.php:61    [M] NewObject

--- Original
+++ New
@@ @@
     public function compile() : array
     {
         $inputPaths = array_map(function (string $path) {
-            return new PropertyPath($path);
+            new PropertyPath($path);
+            return null;
         }, $this->inputFields);
         $outputPath = new PropertyPath($this->outputField);
         $nodes = array_merge(array_map(function (PropertyPath $path) {

53) /var/www/html/src/FieldConcatCopyValuesMapper.php:67    [M] UnwrapArrayMerge

--- Original
+++ New
@@ @@
             return new PropertyPath($path);
         }, $this->inputFields);
         $outputPath = new PropertyPath($this->outputField);
-        $nodes = array_merge(array_map(function (PropertyPath $path) {
-            return new RequiredValuePreconditionBuilder($path, new Node\Expr\Variable('input'));
-        }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
+        $nodes = ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);

55) /var/www/html/src/FieldConcatCopyValuesMapper.php:67    [M] UnwrapArrayMerge

--- Original
+++ New
@@ @@
             return new PropertyPath($path);
         }, $this->inputFields);
         $outputPath = new PropertyPath($this->outputField);
-        $nodes = array_merge(array_map(function (PropertyPath $path) {
+        $nodes = array_map(function (PropertyPath $path) {
             return new RequiredValuePreconditionBuilder($path, new Node\Expr\Variable('input'));
-        }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
-            $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
-            return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);

57) /var/www/html/src/FieldConcatCopyValuesMapper.php:68    [M] UnwrapArrayMap

--- Original
+++ New
@@ @@
             return new PropertyPath($path);
         }, $this->inputFields);
         $outputPath = new PropertyPath($this->outputField);
-        $nodes = array_merge(array_map(function (PropertyPath $path) {
-            return new RequiredValuePreconditionBuilder($path, new Node\Expr\Variable('input'));
-        }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
+        $nodes = array_merge($inputPaths, [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);

58) /var/www/html/src/FieldConcatCopyValuesMapper.php:70    [M] NewObject

--- Original
+++ New
@@ @@
         }, $this->inputFields);
         $outputPath = new PropertyPath($this->outputField);
         $nodes = array_merge(array_map(function (PropertyPath $path) {
-            return new RequiredValuePreconditionBuilder($path, new Node\Expr\Variable('input'));
+            new RequiredValuePreconditionBuilder($path, new Node\Expr\Variable('input'));
+            return null;
         }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);

59) /var/www/html/src/FieldConcatCopyValuesMapper.php:74    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $outputPath = new PropertyPath($this->outputField);
         $nodes = array_merge(array_map(function (PropertyPath $path) {
             return new RequiredValuePreconditionBuilder($path, new Node\Expr\Variable('input'));
-        }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
+        }, $inputPaths), [], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
         }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], []);

60) /var/www/html/src/FieldConcatCopyValuesMapper.php:77    [M] GreaterThan

--- Original
+++ New
@@ @@
         $outputPath = new PropertyPath($this->outputField);
         $nodes = array_merge(array_map(function (PropertyPath $path) {
             return new RequiredValuePreconditionBuilder($path, new Node\Expr\Variable('input'));
-        }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
+        }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) >= 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
         }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], []);

61) /var/www/html/src/FieldConcatCopyValuesMapper.php:77    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
         $outputPath = new PropertyPath($this->outputField);
         $nodes = array_merge(array_map(function (PropertyPath $path) {
             return new RequiredValuePreconditionBuilder($path, new Node\Expr\Variable('input'));
-        }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
+        }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) <= 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
         }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], []);

62) /var/www/html/src/FieldConcatCopyValuesMapper.php:78    [M] UnwrapArrayMap

--- Original
+++ New
@@ @@
         $outputPath = new PropertyPath($this->outputField);
         $nodes = array_merge(array_map(function (PropertyPath $path) {
             return new RequiredValuePreconditionBuilder($path, new Node\Expr\Variable('input'));
-        }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
-            $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
-            return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], []);
+        }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1)) : [], []);
         $it = new \ArrayIterator($inputPaths);

63) /var/www/html/src/FieldConcatCopyValuesMapper.php:84    [M] NewObject

--- Original
+++ New
@@ @@
             return new RequiredValuePreconditionBuilder($path, new Node\Expr\Variable('input'));
         }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
-            return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
+            new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
+            return null;
         }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], []);
         $it = new \ArrayIterator($inputPaths);
         $it->rewind();

64) /var/www/html/src/FieldConcatCopyValuesMapper.php:86    [M] IncrementInteger

--- Original
+++ New
@@ @@
         }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], []);
+        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 2))) : [], []);
         $it = new \ArrayIterator($inputPaths);
         $it->rewind();
         $values = [];

65) /var/www/html/src/FieldConcatCopyValuesMapper.php:86    [M] Minus

--- Original
+++ New
@@ @@
         }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], []);
+        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) + 1))) : [], []);
         $it = new \ArrayIterator($inputPaths);
         $it->rewind();
         $values = [];

66) /var/www/html/src/FieldConcatCopyValuesMapper.php:86    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], []);
+        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 0))) : [], []);
         $it = new \ArrayIterator($inputPaths);
         $it->rewind();
         $values = [];

67) /var/www/html/src/FieldConcatCopyValuesMapper.php:86    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], []);
+        }, iterator_to_array(new \LimitIterator($iterator, 1, iterator_count($iterator) - 1))) : [], []);
         $it = new \ArrayIterator($inputPaths);
         $it->rewind();
         $values = [];

68) /var/www/html/src/FieldConcatCopyValuesMapper.php:86    [M] DecrementInteger

--- Original
+++ New
@@ @@
         }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], []);
+        }, iterator_to_array(new \LimitIterator($iterator, -1, iterator_count($iterator) - 1))) : [], []);
         $it = new \ArrayIterator($inputPaths);
         $it->rewind();
         $values = [];

71) /var/www/html/src/FieldConcatCopyValuesMapper.php:100    [M] LogicalNot

--- Original
+++ New
@@ @@
         while ($it->valid()) {
             $values[] = (new PropertyPathBuilder($it->current(), new Node\Expr\Variable('input')))->getNode();
             $it->next();
-            if (!$it->valid()) {
+            if ($it->valid()) {
                 break;
             }
             $values[] = new Node\Scalar\String_($this->glue);

74) /var/www/html/src/FieldConcatCopyValuesMapper.php:109    [M] UnwrapArrayMerge

--- Original
+++ New
@@ @@
             $values[] = new Node\Scalar\String_($this->glue);
         }
         $factory = new BuilderFactory();
-        return array_merge($nodes, [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), $factory->concat(...$values))]);
+        return $nodes;
     }
 }

75) /var/www/html/src/FieldConcatCopyValuesMapper.php:111    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $values[] = new Node\Scalar\String_($this->glue);
         }
         $factory = new BuilderFactory();
-        return array_merge($nodes, [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), $factory->concat(...$values))]);
+        return array_merge($nodes, []);
     }
 }

77) /var/www/html/src/FieldConstantValueMapper.php:46    [M] UnwrapArrayMerge

--- Original
+++ New
@@ @@
     public function compile() : array
     {
         $outputPath = new PropertyPath($this->outputField);
-        return array_merge([new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
-            $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
-            return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))]);
+        return [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))];
     }

78) /var/www/html/src/FieldConstantValueMapper.php:46    [M] UnwrapArrayMerge

--- Original
+++ New
@@ @@
     public function compile() : array
     {
         $outputPath = new PropertyPath($this->outputField);
-        return array_merge([new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
+        return ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))]);
+        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [];

79) /var/www/html/src/FieldConstantValueMapper.php:47    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function compile() : array
     {
         $outputPath = new PropertyPath($this->outputField);
-        return array_merge([new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
+        return array_merge([], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
         }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))]);
     }

80) /var/www/html/src/FieldConstantValueMapper.php:50    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     public function compile() : array
     {
         $outputPath = new PropertyPath($this->outputField);
-        return array_merge([new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
+        return array_merge([new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) <= 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
         }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))]);
     }

81) /var/www/html/src/FieldConstantValueMapper.php:50    [M] GreaterThan

--- Original
+++ New
@@ @@
     public function compile() : array
     {
         $outputPath = new PropertyPath($this->outputField);
-        return array_merge([new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
+        return array_merge([new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) >= 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
         }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))]);
     }

84) /var/www/html/src/FieldConstantValueMapper.php:59    [M] IncrementInteger

--- Original
+++ New
@@ @@
         return array_merge([new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))]);
+        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 2))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))]);
     }
 }

87) /var/www/html/src/FieldConstantValueMapper.php:59    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         return array_merge([new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))]);
+        }, iterator_to_array(new \LimitIterator($iterator, 1, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))]);
     }
 }

88) /var/www/html/src/FieldConstantValueMapper.php:59    [M] DecrementInteger

--- Original
+++ New
@@ @@
         return array_merge([new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))]);
+        }, iterator_to_array(new \LimitIterator($iterator, -1, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))]);
     }
 }

89) /var/www/html/src/FieldConstantValueMapper.php:61    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         return array_merge([new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))]);
+        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], []);
     }
 }

97) /var/www/html/src/FieldCopyValueMapper.php:63    [M] NewObject

--- Original
+++ New
@@ @@
             if ($iterator->isIndex()) {
                 $outputNode = new Node\Expr\ArrayDimFetch($outputNode, is_int($item) ? new Node\Scalar\LNumber($item) : new Node\Scalar\String_($item));
-                return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
+                new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
+                return null;
             }
             if ($iterator->isProperty()) {
                 $outputNode = new Node\Expr\PropertyFetch($outputNode, new Node\Name($item));

100) /var/www/html/src/FieldCopyValueMapper.php:75    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 return new ObjectInitialisationPreconditionBuilder($outputPath, $outputNode, new ClassTypeMetadata('Baz', 'Foo\\Bar'));
             }
             throw new \RuntimeException('Object initialization is not implemented yet.');
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), (new PropertyPathBuilder($inputPath, new Node\Expr\Variable('input')))->getNode())]);
+        }, iterator_to_array(new \LimitIterator($iterator, -1, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), (new PropertyPathBuilder($inputPath, new Node\Expr\Variable('input')))->getNode())]);
     }
 }
