101) /var/www/html/src/FieldCopyValueMapper.php:75    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                 return new ObjectInitialisationPreconditionBuilder($outputPath, $outputNode, new ClassTypeMetadata('Baz', 'Foo\\Bar'));
             }
             throw new \RuntimeException('Object initialization is not implemented yet.');
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), (new PropertyPathBuilder($inputPath, new Node\Expr\Variable('input')))->getNode())]);
+        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 0))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), (new PropertyPathBuilder($inputPath, new Node\Expr\Variable('input')))->getNode())]);
     }
 }

102) /var/www/html/src/FieldCopyValueMapper.php:75    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                 return new ObjectInitialisationPreconditionBuilder($outputPath, $outputNode, new ClassTypeMetadata('Baz', 'Foo\\Bar'));
             }
             throw new \RuntimeException('Object initialization is not implemented yet.');
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), (new PropertyPathBuilder($inputPath, new Node\Expr\Variable('input')))->getNode())]);
+        }, iterator_to_array(new \LimitIterator($iterator, 1, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), (new PropertyPathBuilder($inputPath, new Node\Expr\Variable('input')))->getNode())]);
     }
 }

103) /var/www/html/src/FieldCopyValueMapper.php:75    [M] Minus

--- Original
+++ New
@@ @@
                 return new ObjectInitialisationPreconditionBuilder($outputPath, $outputNode, new ClassTypeMetadata('Baz', 'Foo\\Bar'));
             }
             throw new \RuntimeException('Object initialization is not implemented yet.');
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), (new PropertyPathBuilder($inputPath, new Node\Expr\Variable('input')))->getNode())]);
+        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) + 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), (new PropertyPathBuilder($inputPath, new Node\Expr\Variable('input')))->getNode())]);
     }
 }

104) /var/www/html/src/FieldCopyValueMapper.php:75    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 return new ObjectInitialisationPreconditionBuilder($outputPath, $outputNode, new ClassTypeMetadata('Baz', 'Foo\\Bar'));
             }
             throw new \RuntimeException('Object initialization is not implemented yet.');
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), (new PropertyPathBuilder($inputPath, new Node\Expr\Variable('input')))->getNode())]);
+        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 2))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), (new PropertyPathBuilder($inputPath, new Node\Expr\Variable('input')))->getNode())]);
     }
 }

105) /var/www/html/src/FieldCopyValueMapper.php:77    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 return new ObjectInitialisationPreconditionBuilder($outputPath, $outputNode, new ClassTypeMetadata('Baz', 'Foo\\Bar'));
             }
             throw new \RuntimeException('Object initialization is not implemented yet.');
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), (new PropertyPathBuilder($inputPath, new Node\Expr\Variable('input')))->getNode())]);
+        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], []);
     }
 }

113) /var/www/html/src/MappingDefinition/Guesser/PublicPropertyFieldGuesser.php:31    [M] LogicalNot

--- Original
+++ New
@@ @@
     private function filterTypes(TypeMetadata ...$types) : \Generator
     {
         foreach ($types as $type) {
-            if (!$type instanceof ScalarTypeMetadata && !$type instanceof ArrayTypeMetadata) {
+            if ($type instanceof ScalarTypeMetadata && !$type instanceof ArrayTypeMetadata) {
                 continue;
             }
             (yield $type);

114) /var/www/html/src/MappingDefinition/Guesser/PublicPropertyFieldGuesser.php:31    [M] LogicalAnd

--- Original
+++ New
@@ @@
     private function filterTypes(TypeMetadata ...$types) : \Generator
     {
         foreach ($types as $type) {
-            if (!$type instanceof ScalarTypeMetadata && !$type instanceof ArrayTypeMetadata) {
+            if (!$type instanceof ScalarTypeMetadata || !$type instanceof ArrayTypeMetadata) {
                 continue;
             }
             (yield $type);

115) /var/www/html/src/MappingDefinition/Guesser/PublicPropertyFieldGuesser.php:32    [M] LogicalNot

--- Original
+++ New
@@ @@
     private function filterTypes(TypeMetadata ...$types) : \Generator
     {
         foreach ($types as $type) {
-            if (!$type instanceof ScalarTypeMetadata && !$type instanceof ArrayTypeMetadata) {
+            if (!$type instanceof ScalarTypeMetadata && $type instanceof ArrayTypeMetadata) {
                 continue;
             }
             (yield $type);

131) /var/www/html/src/MappingDefinition/Guesser/PublicPropertyUnaryRelationGuesser.php:30    [M] LogicalNot

--- Original
+++ New
@@ @@
     private function filterTypes(TypeMetadata ...$types) : \Generator
     {
         foreach ($types as $type) {
-            if (!$type instanceof CompositeTypeMetadata) {
+            if ($type instanceof CompositeTypeMetadata) {
                 continue;
             }
             (yield $type);

132) /var/www/html/src/MappingDefinition/Guesser/PublicPropertyUnaryRelationGuesser.php:31    [M] Continue_

--- Original
+++ New
@@ @@
     {
         foreach ($types as $type) {
             if (!$type instanceof CompositeTypeMetadata) {
-                continue;
+                break;
             }
             (yield $type);
         }
     }

153) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:59    [M] LogicalAnd

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$fieldName][$action] = $method;
                 } else {
-                    if (preg_match('/(?<action>unset|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 0) {
+                    if (preg_match('/(?<action>unset|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) || count($method->argumentList->arguments) === 0) {
                         $action = $matches['action'];
                         $fieldName = $this->inflector->camelize($matches['fieldName']);
                         if (!$this->isSingular($fieldName)) {

154) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:59    [M] PregMatchMatches

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$fieldName][$action] = $method;
                 } else {
-                    if (preg_match('/(?<action>unset|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 0) {
+                    if ((int) ($matches = array()) && count($method->argumentList->arguments) === 0) {
                         $action = $matches['action'];
                         $fieldName = $this->inflector->camelize($matches['fieldName']);
                         if (!$this->isSingular($fieldName)) {

155) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:60    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$fieldName][$action] = $method;
                 } else {
-                    if (preg_match('/(?<action>unset|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 0) {
+                    if (preg_match('/(?<action>unset|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 1) {
                         $action = $matches['action'];
                         $fieldName = $this->inflector->camelize($matches['fieldName']);
                         if (!$this->isSingular($fieldName)) {

156) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:60    [M] Identical

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$fieldName][$action] = $method;
                 } else {
-                    if (preg_match('/(?<action>unset|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 0) {
+                    if (preg_match('/(?<action>unset|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) !== 0) {
                         $action = $matches['action'];
                         $fieldName = $this->inflector->camelize($matches['fieldName']);
                         if (!$this->isSingular($fieldName)) {

168) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:89    [M] Coalesce

--- Original
+++ New
@@ @@
             if (!isset($accessor) && !isset($mutator)) {
                 continue;
             }
-            (yield new VirtualFieldDefinition($fieldName, $accessor, $mutator, $actions['has'] ?? null, $actions['unset'] ?? null));
+            (yield new VirtualFieldDefinition($fieldName, $accessor, $mutator, null, $actions['unset'] ?? null));
         }
     }
 }

169) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:90    [M] Coalesce

--- Original
+++ New
@@ @@
             if (!isset($accessor) && !isset($mutator)) {
                 continue;
             }
-            (yield new VirtualFieldDefinition($fieldName, $accessor, $mutator, $actions['has'] ?? null, $actions['unset'] ?? null));
+            (yield new VirtualFieldDefinition($fieldName, $accessor, $mutator, $actions['has'] ?? null, null));
         }
     }
 }
