28) /var/www/html/src/Compiler/Compiler.php:70    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return new $fqcn();
     }
-    public function buildTree(string $namespace, string $className, CompilableMapperInterface ...$mappers) : array
+    protected function buildTree(string $namespace, string $className, CompilableMapperInterface ...$mappers) : array
     {
         $factory = new BuilderFactory();
         $calls = [new Node\Expr\Array_([], ['kind' => Node\Expr\Array_::KIND_SHORT])];

29) /var/www/html/src/Compiler/Compiler.php:74    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function buildTree(string $namespace, string $className, CompilableMapperInterface ...$mappers) : array
     {
         $factory = new BuilderFactory();
-        $calls = [new Node\Expr\Array_([], ['kind' => Node\Expr\Array_::KIND_SHORT])];
+        $calls = [];
         $methods = [];
         foreach ($mappers as $mapper) {
             $methodName = $this->randomMethodName('map_');

30) /var/www/html/src/Compiler/Compiler.php:75    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function buildTree(string $namespace, string $className, CompilableMapperInterface ...$mappers) : array
     {
         $factory = new BuilderFactory();
-        $calls = [new Node\Expr\Array_([], ['kind' => Node\Expr\Array_::KIND_SHORT])];
+        $calls = [new Node\Expr\Array_([], [])];
         $methods = [];
         foreach ($mappers as $mapper) {
             $methodName = $this->randomMethodName('map_');
