1) /var/www/html/src/CompiledMapper.php:26    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     public function __construct(Compiler $compiler, string $fqcn, string $cachePath, MapperInterface ...$mappers)
     {
         $this->compiler = $compiler;
-        $namespace = substr($fqcn, 0, strpos($fqcn, '\\') + 1);
+        $namespace = substr($fqcn, 1, strpos($fqcn, '\\') + 1);
         $className = substr($fqcn, strpos($fqcn, '\\') + 1);
         $this->compilationContext = new CompilationContext($cachePath . $className . '.php', $namespace, $className, ...$mappers);
     }

2) /var/www/html/src/CompiledMapper.php:26    [M] Plus

--- Original
+++ New
@@ @@
     public function __construct(Compiler $compiler, string $fqcn, string $cachePath, MapperInterface ...$mappers)
     {
         $this->compiler = $compiler;
-        $namespace = substr($fqcn, 0, strpos($fqcn, '\\') + 1);
+        $namespace = substr($fqcn, 0, strpos($fqcn, '\\') - 1);
         $className = substr($fqcn, strpos($fqcn, '\\') + 1);
         $this->compilationContext = new CompilationContext($cachePath . $className . '.php', $namespace, $className, ...$mappers);
     }

3) /var/www/html/src/CompiledMapper.php:26    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function __construct(Compiler $compiler, string $fqcn, string $cachePath, MapperInterface ...$mappers)
     {
         $this->compiler = $compiler;
-        $namespace = substr($fqcn, 0, strpos($fqcn, '\\') + 1);
+        $namespace = substr($fqcn, -1, strpos($fqcn, '\\') + 1);
         $className = substr($fqcn, strpos($fqcn, '\\') + 1);
         $this->compilationContext = new CompilationContext($cachePath . $className . '.php', $namespace, $className, ...$mappers);
     }

4) /var/www/html/src/CompiledMapper.php:26    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function __construct(Compiler $compiler, string $fqcn, string $cachePath, MapperInterface ...$mappers)
     {
         $this->compiler = $compiler;
-        $namespace = substr($fqcn, 0, strpos($fqcn, '\\') + 1);
+        $namespace = substr($fqcn, 0, strpos($fqcn, '\\') + 2);
         $className = substr($fqcn, strpos($fqcn, '\\') + 1);
         $this->compilationContext = new CompilationContext($cachePath . $className . '.php', $namespace, $className, ...$mappers);
     }

5) /var/www/html/src/CompiledMapper.php:26    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     public function __construct(Compiler $compiler, string $fqcn, string $cachePath, MapperInterface ...$mappers)
     {
         $this->compiler = $compiler;
-        $namespace = substr($fqcn, 0, strpos($fqcn, '\\') + 1);
+        $namespace = substr($fqcn, 0, strpos($fqcn, '\\') + 0);
         $className = substr($fqcn, strpos($fqcn, '\\') + 1);
         $this->compilationContext = new CompilationContext($cachePath . $className . '.php', $namespace, $className, ...$mappers);
     }

6) /var/www/html/src/CompiledMapper.php:27    [M] Plus

--- Original
+++ New
@@ @@
     {
         $this->compiler = $compiler;
         $namespace = substr($fqcn, 0, strpos($fqcn, '\\') + 1);
-        $className = substr($fqcn, strpos($fqcn, '\\') + 1);
+        $className = substr($fqcn, strpos($fqcn, '\\') - 1);
         $this->compilationContext = new CompilationContext($cachePath . $className . '.php', $namespace, $className, ...$mappers);
     }
     public function __invoke($input, $output) : array

7) /var/www/html/src/CompiledMapper.php:27    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     {
         $this->compiler = $compiler;
         $namespace = substr($fqcn, 0, strpos($fqcn, '\\') + 1);
-        $className = substr($fqcn, strpos($fqcn, '\\') + 1);
+        $className = substr($fqcn, strpos($fqcn, '\\') + 0);
         $this->compilationContext = new CompilationContext($cachePath . $className . '.php', $namespace, $className, ...$mappers);
     }
     public function __invoke($input, $output) : array

8) /var/www/html/src/CompiledMapper.php:27    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $this->compiler = $compiler;
         $namespace = substr($fqcn, 0, strpos($fqcn, '\\') + 1);
-        $className = substr($fqcn, strpos($fqcn, '\\') + 1);
+        $className = substr($fqcn, strpos($fqcn, '\\') + 2);
         $this->compilationContext = new CompilationContext($cachePath . $className . '.php', $namespace, $className, ...$mappers);
     }
     public function __invoke($input, $output) : array

9) /var/www/html/src/Compiler/Builder/ArrayInitialisationPreconditionBuilder.php:28    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getNode() : Node
     {
-        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), ['stmts' => [new Node\Stmt\Expression(new Node\Expr\Assign($this->pathNode, new Node\Expr\Array_([], ['kind' => Node\Expr\Array_::KIND_SHORT])))]]);
+        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), []);
     }
 }

10) /var/www/html/src/Compiler/Builder/ArrayInitialisationPreconditionBuilder.php:29    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getNode() : Node
     {
-        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), ['stmts' => [new Node\Stmt\Expression(new Node\Expr\Assign($this->pathNode, new Node\Expr\Array_([], ['kind' => Node\Expr\Array_::KIND_SHORT])))]]);
+        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), ['stmts' => []]);
     }
 }

11) /var/www/html/src/Compiler/Builder/ArrayInitialisationPreconditionBuilder.php:33    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getNode() : Node
     {
-        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), ['stmts' => [new Node\Stmt\Expression(new Node\Expr\Assign($this->pathNode, new Node\Expr\Array_([], ['kind' => Node\Expr\Array_::KIND_SHORT])))]]);
+        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), ['stmts' => [new Node\Stmt\Expression(new Node\Expr\Assign($this->pathNode, new Node\Expr\Array_([], [])))]]);
     }
 }

12) /var/www/html/src/Compiler/Builder/PropertyPathBuilder.php:30    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
     {
         $pathNode = $this->pathNode;
         $iterator = $this->propertyPath->getIterator();
-        if ($this->limit < 0) {
+        if ($this->limit >= 0) {
             $iterator = new \LimitIterator($iterator, 0, iterator_count($iterator) + $this->limit);
         } else {
             if ($this->limit !== null) {

13) /var/www/html/src/Compiler/Builder/PropertyPathBuilder.php:30    [M] LessThan

--- Original
+++ New
@@ @@
     {
         $pathNode = $this->pathNode;
         $iterator = $this->propertyPath->getIterator();
-        if ($this->limit < 0) {
+        if ($this->limit <= 0) {
             $iterator = new \LimitIterator($iterator, 0, iterator_count($iterator) + $this->limit);
         } else {
             if ($this->limit !== null) {

20) /var/www/html/src/FieldConcatCopyValuesMapper.php:67    [M] UnwrapArrayMerge

--- Original
+++ New
@@ @@
             return new PropertyPath($path);
         }, $this->inputFields);
         $outputPath = new PropertyPath($this->outputField);
-        $nodes = array_merge(array_map(function (PropertyPath $path) {
+        $nodes = array_map(function (PropertyPath $path) {
             return (new RequiredValuePreconditionBuilder($path, new Node\Expr\Variable('input')))->getNode();
-        }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
-            $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
-            return (new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode))->getNode();

22) /var/www/html/src/FieldConcatCopyValuesMapper.php:86    [M] Minus

--- Original
+++ New
@@ @@
         }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return (new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode))->getNode();
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], []);
+        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) + 1))) : [], []);
         $it = new \ArrayIterator($inputPaths);
         $it->rewind();
         $values = [];

23) /var/www/html/src/FieldConcatCopyValuesMapper.php:86    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         }, $inputPaths), [new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return (new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode))->getNode();
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], []);
+        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 0))) : [], []);
         $it = new \ArrayIterator($inputPaths);
         $it->rewind();
         $values = [];

24) /var/www/html/src/FieldConcatCopyValuesMapper.php:93    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             return (new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode))->getNode();
         }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], []);
         $it = new \ArrayIterator($inputPaths);
-        $it->rewind();
+        
         $values = [];
         while ($it->valid()) {
             $values[] = (new PropertyPathBuilder($it->current(), new Node\Expr\Variable('input')))->getNode();

25) /var/www/html/src/FieldConcatCopyValuesMapper.php:101    [M] Break_

--- Original
+++ New
@@ @@
             $values[] = (new PropertyPathBuilder($it->current(), new Node\Expr\Variable('input')))->getNode();
             $it->next();
             if (!$it->valid()) {
-                break;
+                continue;
             }
             $values[] = new Node\Scalar\String_($this->glue);
         }

26) /var/www/html/src/FieldConcatCopyValuesMapper.php:109    [M] UnwrapArrayMerge

--- Original
+++ New
@@ @@
             $values[] = new Node\Scalar\String_($this->glue);
         }
         $factory = new BuilderFactory();
-        return array_merge($nodes, [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), $factory->concat(...$values))]);
+        return [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), $factory->concat(...$values))];
     }
 }

27) /var/www/html/src/FieldConstantValueMapper.php:46    [M] UnwrapArrayMerge

--- Original
+++ New
@@ @@
     public function compile() : array
     {
         $outputPath = new PropertyPath($this->outputField);
-        return array_merge([new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
-            $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
-            return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))]);
+        return [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))];
     }

28) /var/www/html/src/FieldConstantValueMapper.php:59    [M] Minus

--- Original
+++ New
@@ @@
         return array_merge([new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))]);
+        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) + 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))]);
     }
 }

29) /var/www/html/src/FieldConstantValueMapper.php:59    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         return array_merge([new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode = new Node\Expr\Variable('output'))], ($count = iterator_count($iterator = $outputPath->getIterator())) > 1 ? array_map(function ($item) use($outputPath, &$outputNode) {
             $outputNode = new Node\Expr\ArrayDimFetch($outputNode, new Node\Scalar\String_($item));
             return new ArrayInitialisationPreconditionBuilder($outputPath, $outputNode);
-        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))]);
+        }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 0))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), new Node\Scalar\String_($this->value))]);
     }
 }

33) /var/www/html/src/MappingDefinition/Guesser/PublicPropertyFieldGuesser.php:23    [M] UnwrapArrayValues

--- Original
+++ New
@@ @@
             if (count($types) <= 0) {
                 continue;
             }
-            (yield new FieldDefinition($property->name, ...array_values($property->types)));
+            (yield new FieldDefinition($property->name, ...$property->types));
         }
     }
     private function filterTypes(TypeMetadataInterface ...$types) : \Generator

35) /var/www/html/src/MappingDefinition/MappingIterator.php:29    [M] Break_

--- Original
+++ New
@@ @@
         foreach ($builders as $builder) {
             if ($builder->matches($metadata)) {
                 $this->inner = $builder->walk($metadata);
-                break;
+                continue;
             }
         }
     }

36) /var/www/html/src/MappingDefinition/MappingIterator.php:56    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function rewind()
     {
-        $this->inner->rewind();
+        
     }
     public function hasChildren()
     {

1) /var/www/html/src/FieldConcatCopyValuesMapper.php:99    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $values = [];
         while ($it->valid()) {
             $values[] = (new PropertyPathBuilder($it->current(), new Node\Expr\Variable('input')))->getNode();
-            $it->next();
+            
             if (!$it->valid()) {
                 break;
             }

Not Covered mutants:
====================

1) /var/www/html/src/CompiledMapper.php:39    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function __invoke($input, $output) : array
     {
-        if ($this->compiledMapper === null) {
+        if ($this->compiledMapper !== null) {
             $this->compiledMapper = $this->compiler->compile($this->compilationContext);
         }
         return $this->compiledMapper->map($input, $output);
     }

2) /var/www/html/src/Compiler/Builder/CompositeInitialisationPreconditionBuilder.php:36    [M] Foreach_

--- Original
+++ New
@@ @@
         $conditions = new \SplQueue();
         $initialisations = new \SplQueue();
         $pathNode = $this->pathNode;
-        foreach ($iterator = $this->propertyPath->getIterator() as $item) {
+        foreach (array() as $item) {
             if ($iterator->isIndex()) {
                 $pathNode = new Node\Expr\ArrayDimFetch($pathNode, is_int($item) ? new Node\Scalar\LNumber($item) : new Node\Scalar\String_($item));
                 continue;

3) /var/www/html/src/Compiler/Builder/CompositeInitialisationPreconditionBuilder.php:43    [M] Continue_

--- Original
+++ New
@@ @@
         foreach ($iterator = $this->propertyPath->getIterator() as $item) {
             if ($iterator->isIndex()) {
                 $pathNode = new Node\Expr\ArrayDimFetch($pathNode, is_int($item) ? new Node\Scalar\LNumber($item) : new Node\Scalar\String_($item));
-                continue;
+                break;
             }
             if ($iterator->isProperty()) {
                 $pathNode = new Node\Expr\PropertyFetch($pathNode, is_int($item) ? new Node\Scalar\LNumber($item) : new Node\Name($item));

4) /var/www/html/src/Compiler/Builder/CompositeInitialisationPreconditionBuilder.php:52    [M] Continue_

--- Original
+++ New
@@ @@
             }
             if ($iterator->isProperty()) {
                 $pathNode = new Node\Expr\PropertyFetch($pathNode, is_int($item) ? new Node\Scalar\LNumber($item) : new Node\Name($item));
-                continue;
+                break;
             }
             throw new \RuntimeException('Path spec should be either an array dimension access or an object property access.');
         }

5) /var/www/html/src/Compiler/Builder/CompositeInitialisationPreconditionBuilder.php:55    [M] Throw_

--- Original
+++ New
@@ @@
                 $pathNode = new Node\Expr\PropertyFetch($pathNode, is_int($item) ? new Node\Scalar\LNumber($item) : new Node\Name($item));
                 continue;
             }
-            throw new \RuntimeException('Path spec should be either an array dimension access or an object property access.');
+            new \RuntimeException('Path spec should be either an array dimension access or an object property access.');
         }
         return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), ['stmts' => [new Node\Stmt\Expression(new Node\Expr\Assign($this->pathNode, new Node\Expr\Array_([], ['kind' => Node\Expr\Array_::KIND_SHORT])))]]);
     }

6) /var/www/html/src/Compiler/Builder/CompositeInitialisationPreconditionBuilder.php:60    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             }
             throw new \RuntimeException('Path spec should be either an array dimension access or an object property access.');
         }
-        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), ['stmts' => [new Node\Stmt\Expression(new Node\Expr\Assign($this->pathNode, new Node\Expr\Array_([], ['kind' => Node\Expr\Array_::KIND_SHORT])))]]);
+        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([])), ['stmts' => [new Node\Stmt\Expression(new Node\Expr\Assign($this->pathNode, new Node\Expr\Array_([], ['kind' => Node\Expr\Array_::KIND_SHORT])))]]);
     }
     private function propertyFetch(PropertyPathIteratorInterface $iterator, Node\Expr $pathNode)
     {

7) /var/www/html/src/Compiler/Builder/CompositeInitialisationPreconditionBuilder.php:62    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             }
             throw new \RuntimeException('Path spec should be either an array dimension access or an object property access.');
         }
-        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), ['stmts' => [new Node\Stmt\Expression(new Node\Expr\Assign($this->pathNode, new Node\Expr\Array_([], ['kind' => Node\Expr\Array_::KIND_SHORT])))]]);
+        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), []);
     }
     private function propertyFetch(PropertyPathIteratorInterface $iterator, Node\Expr $pathNode)
     {

8) /var/www/html/src/Compiler/Builder/CompositeInitialisationPreconditionBuilder.php:63    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             }
             throw new \RuntimeException('Path spec should be either an array dimension access or an object property access.');
         }
-        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), ['stmts' => [new Node\Stmt\Expression(new Node\Expr\Assign($this->pathNode, new Node\Expr\Array_([], ['kind' => Node\Expr\Array_::KIND_SHORT])))]]);
+        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), ['stmts' => []]);
     }
     private function propertyFetch(PropertyPathIteratorInterface $iterator, Node\Expr $pathNode)
     {

9) /var/www/html/src/Compiler/Builder/CompositeInitialisationPreconditionBuilder.php:67    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             }
             throw new \RuntimeException('Path spec should be either an array dimension access or an object property access.');
         }
-        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), ['stmts' => [new Node\Stmt\Expression(new Node\Expr\Assign($this->pathNode, new Node\Expr\Array_([], ['kind' => Node\Expr\Array_::KIND_SHORT])))]]);
+        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), ['stmts' => [new Node\Stmt\Expression(new Node\Expr\Assign($this->pathNode, new Node\Expr\Array_([], [])))]]);
     }
     private function propertyFetch(PropertyPathIteratorInterface $iterator, Node\Expr $pathNode)
     {

10) /var/www/html/src/Compiler/Builder/CompositeInitialisationPreconditionBuilder.php:81    [M] LogicalAnd

--- Original
+++ New
@@ @@
     }
     private function propertyFetch(PropertyPathIteratorInterface $iterator, Node\Expr $pathNode)
     {
-        while ($iterator->valid() && $iterator->isProperty()) {
+        while ($iterator->valid() || $iterator->isProperty()) {
             $item = $iterator->current();
             $pathNode = new Node\Expr\PropertyFetch($pathNode, is_int($item) ? new Node\Scalar\LNumber($item) : new Node\Name($item));
             $iterator->next();

11) /var/www/html/src/Compiler/Builder/CompositeInitialisationPreconditionBuilder.php:89    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         while ($iterator->valid() && $iterator->isProperty()) {
             $item = $iterator->current();
             $pathNode = new Node\Expr\PropertyFetch($pathNode, is_int($item) ? new Node\Scalar\LNumber($item) : new Node\Name($item));
-            $iterator->next();
+            
         }
     }
 }

12) /var/www/html/src/Compiler/Builder/ObjectInitialisationPreconditionBuilder.php:30    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getNode() : Node
     {
-        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), ['stmts' => [new Node\Stmt\Expression(new Node\Expr\Assign($this->pathNode, new Node\Expr\New_(new Node\Name($this->metadata->name))))]]);
+        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([])), ['stmts' => [new Node\Stmt\Expression(new Node\Expr\Assign($this->pathNode, new Node\Expr\New_(new Node\Name($this->metadata->name))))]]);
     }
 }

13) /var/www/html/src/Compiler/Builder/ObjectInitialisationPreconditionBuilder.php:32    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getNode() : Node
     {
-        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), ['stmts' => [new Node\Stmt\Expression(new Node\Expr\Assign($this->pathNode, new Node\Expr\New_(new Node\Name($this->metadata->name))))]]);
+        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), []);
     }
 }

14) /var/www/html/src/Compiler/Builder/ObjectInitialisationPreconditionBuilder.php:33    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function getNode() : Node
     {
-        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), ['stmts' => [new Node\Stmt\Expression(new Node\Expr\Assign($this->pathNode, new Node\Expr\New_(new Node\Name($this->metadata->name))))]]);
+        return new Node\Stmt\If_(new Node\Expr\BooleanNot(new Node\Expr\Isset_([$this->pathNode])), ['stmts' => []]);
     }
 }

15) /var/www/html/src/Compiler/Builder/PropertyPathBuilder.php:31    [M] Plus

--- Original
+++ New
@@ @@
         $pathNode = $this->pathNode;
         $iterator = $this->propertyPath->getIterator();
         if ($this->limit < 0) {
-            $iterator = new \LimitIterator($iterator, 0, iterator_count($iterator) + $this->limit);
+            $iterator = new \LimitIterator($iterator, 0, iterator_count($iterator) - $this->limit);
         } else {
             if ($this->limit !== null) {
                 $iterator = new \LimitIterator($iterator, 0, $this->limit);

16) /var/www/html/src/Compiler/Builder/PropertyPathBuilder.php:31    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $pathNode = $this->pathNode;
         $iterator = $this->propertyPath->getIterator();
         if ($this->limit < 0) {
-            $iterator = new \LimitIterator($iterator, 0, iterator_count($iterator) + $this->limit);
+            $iterator = new \LimitIterator($iterator, -1, iterator_count($iterator) + $this->limit);
         } else {
             if ($this->limit !== null) {
                 $iterator = new \LimitIterator($iterator, 0, $this->limit);

17) /var/www/html/src/Compiler/Builder/PropertyPathBuilder.php:31    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $pathNode = $this->pathNode;
         $iterator = $this->propertyPath->getIterator();
         if ($this->limit < 0) {
-            $iterator = new \LimitIterator($iterator, 0, iterator_count($iterator) + $this->limit);
+            $iterator = new \LimitIterator($iterator, 1, iterator_count($iterator) + $this->limit);
         } else {
             if ($this->limit !== null) {
                 $iterator = new \LimitIterator($iterator, 0, $this->limit);

18) /var/www/html/src/Compiler/Builder/PropertyPathBuilder.php:33    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $iterator = new \LimitIterator($iterator, 0, iterator_count($iterator) + $this->limit);
         } else {
             if ($this->limit !== null) {
-                $iterator = new \LimitIterator($iterator, 0, $this->limit);
+                $iterator = new \LimitIterator($iterator, -1, $this->limit);
             }
         }
         foreach ($iterator as $index => $child) {

19) /var/www/html/src/Compiler/Builder/PropertyPathBuilder.php:33    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             $iterator = new \LimitIterator($iterator, 0, iterator_count($iterator) + $this->limit);
         } else {
             if ($this->limit !== null) {
-                $iterator = new \LimitIterator($iterator, 0, $this->limit);
+                $iterator = new \LimitIterator($iterator, 1, $this->limit);
             }
         }
         foreach ($iterator as $index => $child) {

20) /var/www/html/src/Compiler/Compiler.php:20    [M] Coalesce

--- Original
+++ New
@@ @@
     private $strategy;
     public function __construct(?StrategyInterface $strategy = null)
     {
-        $this->strategy = $strategy ?? new Spaghetti();
+        $this->strategy = new Spaghetti();
         $this->inflector = (new InflectorFactory())();
     }
     private function randomIdentifier() : string

21) /var/www/html/src/Compiler/Compiler.php:26    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     private function randomIdentifier() : string
     {
-        return hash('sha256', random_bytes(1024));
+        return hash('sha256', random_bytes(1023));
     }
     private function randomClassName(string $prefix) : string
     {

22) /var/www/html/src/Compiler/Compiler.php:26    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     private function randomIdentifier() : string
     {
-        return hash('sha256', random_bytes(1024));
+        return hash('sha256', random_bytes(1025));
     }
     private function randomClassName(string $prefix) : string
     {

23) /var/www/html/src/Compiler/Compiler.php:34    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->inflector->classify($prefix . $this->randomIdentifier());
     }
-    public function compile(CompilationContext $context)
+    protected function compile(CompilationContext $context)
     {
         $namespace = $context->namespace ?? 'Kiboko\\__Mapper__\\';
         $className = $context->className ?? $this->randomClassName('Mapper');
