24) /var/www/html/src/Compiler/Compiler.php:36    [M] Coalesce

--- Original
+++ New
@@ @@
     }
     public function compile(CompilationContext $context)
     {
-        $namespace = $context->namespace ?? 'Kiboko\\__Mapper__\\';
+        $namespace = 'Kiboko\\__Mapper__\\';
         $className = $context->className ?? $this->randomClassName('Mapper');
         if (file_exists($context->path)) {
             include $context->path;

25) /var/www/html/src/Compiler/Compiler.php:37    [M] Coalesce

--- Original
+++ New
@@ @@
     public function compile(CompilationContext $context)
     {
         $namespace = $context->namespace ?? 'Kiboko\\__Mapper__\\';
-        $className = $context->className ?? $this->randomClassName('Mapper');
+        $className = $this->randomClassName('Mapper');
         if (file_exists($context->path)) {
             include $context->path;
         }

26) /var/www/html/src/Compiler/Compiler.php:56    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $tree = $this->strategy->buildTree($namespace, $className, ...$context->mappers);
         $prettyPrinter = new PrettyPrinter\Standard();
         echo $prettyPrinter->prettyPrintFile($tree);
-        if ($context->path !== null && is_writable(dirname($context->path))) {
+        if ($context->path !== null || is_writable(dirname($context->path))) {
             file_put_contents($context->path, $prettyPrinter->prettyPrintFile($tree));
             include $context->path;
         } else {

27) /var/www/html/src/Compiler/Compiler.php:56    [M] NotIdentical

--- Original
+++ New
@@ @@
         $tree = $this->strategy->buildTree($namespace, $className, ...$context->mappers);
         $prettyPrinter = new PrettyPrinter\Standard();
         echo $prettyPrinter->prettyPrintFile($tree);
-        if ($context->path !== null && is_writable(dirname($context->path))) {
+        if ($context->path === null && is_writable(dirname($context->path))) {
             file_put_contents($context->path, $prettyPrinter->prettyPrintFile($tree));
             include $context->path;
         } else {

28) /var/www/html/src/Compiler/Compiler.php:57    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         $prettyPrinter = new PrettyPrinter\Standard();
         echo $prettyPrinter->prettyPrintFile($tree);
         if ($context->path !== null && is_writable(dirname($context->path))) {
-            file_put_contents($context->path, $prettyPrinter->prettyPrintFile($tree));
+            
             include $context->path;
         } else {
             include 'data://text/plain;base64,' . base64_encode($prettyPrinter->prettyPrintFile($tree));

31) /var/www/html/src/Compiler/Strategy/Reduce.php:29    [M] Foreach_

--- Original
+++ New
@@ @@
         $factory = new BuilderFactory();
         $calls = [];
         $methods = [];
-        foreach ($mappers as $mapper) {
+        foreach (array() as $mapper) {
             $methodName = $this->randomMethodName('map_');
             $calls[] = new Node\Expr\MethodCall(new Node\Expr\Variable('this'), $methodName, [new Node\Expr\Variable('input'), new Node\Expr\Variable('output')]);
             $methods[] = $this->wrapMapping($methodName, $factory, $mapper->compile());

32) /var/www/html/src/Compiler/Strategy/Reduce.php:35    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $methods = [];
         foreach ($mappers as $mapper) {
             $methodName = $this->randomMethodName('map_');
-            $calls[] = new Node\Expr\MethodCall(new Node\Expr\Variable('this'), $methodName, [new Node\Expr\Variable('input'), new Node\Expr\Variable('output')]);
+            $calls[] = new Node\Expr\MethodCall(new Node\Expr\Variable('this'), $methodName, [new Node\Expr\Variable('output')]);
             $methods[] = $this->wrapMapping($methodName, $factory, $mapper->compile());
         }

41) /var/www/html/src/Compiler/Strategy/Reduce.php:97    [M] UnwrapArrayMerge

--- Original
+++ New
@@ @@
     }
     private function wrapMapping(string $methodName, BuilderFactory $factory, array $statements)
     {
-        return $factory->method($methodName)->makeFinal()->makePrivate()->addParam($factory->param('input'))->addParam($factory->param('output'))->addStmts(array_merge($statements, [new Node\Stmt\Return_(new Node\Expr\Variable('output'))]));
+        return $factory->method($methodName)->makeFinal()->makePrivate()->addParam($factory->param('input'))->addParam($factory->param('output'))->addStmts([new Node\Stmt\Return_(new Node\Expr\Variable('output'))]);
     }
 }

42) /var/www/html/src/Compiler/Strategy/Reduce.php:97    [M] UnwrapArrayMerge

--- Original
+++ New
@@ @@
     }
     private function wrapMapping(string $methodName, BuilderFactory $factory, array $statements)
     {
-        return $factory->method($methodName)->makeFinal()->makePrivate()->addParam($factory->param('input'))->addParam($factory->param('output'))->addStmts(array_merge($statements, [new Node\Stmt\Return_(new Node\Expr\Variable('output'))]));
+        return $factory->method($methodName)->makeFinal()->makePrivate()->addParam($factory->param('input'))->addParam($factory->param('output'))->addStmts($statements);
     }
 }

43) /var/www/html/src/Compiler/Strategy/Reduce.php:99    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     private function wrapMapping(string $methodName, BuilderFactory $factory, array $statements)
     {
-        return $factory->method($methodName)->makeFinal()->makePrivate()->addParam($factory->param('input'))->addParam($factory->param('output'))->addStmts(array_merge($statements, [new Node\Stmt\Return_(new Node\Expr\Variable('output'))]));
+        return $factory->method($methodName)->makeFinal()->makePrivate()->addParam($factory->param('input'))->addParam($factory->param('output'))->addStmts(array_merge($statements, []));
     }
 }

44) /var/www/html/src/Compiler/Strategy/Spaghetti.php:17    [M] Foreach_

--- Original
+++ New
@@ @@
     {
         $factory = new BuilderFactory();
         $stmts = [];
-        foreach ($mappers as $mapper) {
+        foreach (array() as $mapper) {
             $stmts = array_merge($stmts, $mapper->compile());
         }
     }

45) /var/www/html/src/Compiler/Strategy/Spaghetti.php:18    [M] UnwrapArrayMerge

--- Original
+++ New
@@ @@
         $factory = new BuilderFactory();
         $stmts = [];
         foreach ($mappers as $mapper) {
-            $stmts = array_merge($stmts, $mapper->compile());
+            $stmts = $stmts;
         }
     }
 }

46) /var/www/html/src/Compiler/Strategy/Spaghetti.php:18    [M] UnwrapArrayMerge

--- Original
+++ New
@@ @@
         $factory = new BuilderFactory();
         $stmts = [];
         foreach ($mappers as $mapper) {
-            $stmts = array_merge($stmts, $mapper->compile());
+            $stmts = $mapper->compile();
         }
     }
 }

48) /var/www/html/src/FieldCopyValueMapper.php:70    [M] NewObject

--- Original
+++ New
@@ @@
             }
             if ($iterator->isProperty()) {
                 $outputNode = new Node\Expr\PropertyFetch($outputNode, new Node\Name($item));
-                return new ObjectInitialisationPreconditionBuilder($outputPath, $outputNode, new ClassTypeMetadata('Baz', 'Foo\\Bar'));
+                new ObjectInitialisationPreconditionBuilder($outputPath, $outputNode, new ClassTypeMetadata('Baz', 'Foo\\Bar'));
+                return null;
             }
             throw new \RuntimeException('Object initialization is not implemented yet.');
         }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), (new PropertyPathBuilder($inputPath, new Node\Expr\Variable('input')))->getNode())]);

49) /var/www/html/src/FieldCopyValueMapper.php:73    [M] Throw_

--- Original
+++ New
@@ @@
                 $outputNode = new Node\Expr\PropertyFetch($outputNode, new Node\Name($item));
                 return new ObjectInitialisationPreconditionBuilder($outputPath, $outputNode, new ClassTypeMetadata('Baz', 'Foo\\Bar'));
             }
-            throw new \RuntimeException('Object initialization is not implemented yet.');
+            new \RuntimeException('Object initialization is not implemented yet.');
         }, iterator_to_array(new \LimitIterator($iterator, 0, iterator_count($iterator) - 1))) : [], [new Node\Expr\Assign((new PropertyPathBuilder($outputPath, new Node\Expr\Variable('output')))->getNode(), (new PropertyPathBuilder($inputPath, new Node\Expr\Variable('input')))->getNode())]);
     }
 }

50) /var/www/html/src/MappingDefinition/Guesser/PublicPropertyMultipleRelationGuesser.php:15    [M] Foreach_

--- Original
+++ New
@@ @@
 {
     public function __invoke(ClassTypeMetadata $class) : \Generator
     {
-        foreach ($class->properties as $property) {
+        foreach (array() as $property) {
             $types = iterator_to_array($this->filterTypes(...$property->types));
             if (count($types) <= 0) {
                 continue;

51) /var/www/html/src/MappingDefinition/Guesser/PublicPropertyMultipleRelationGuesser.php:17    [M] LessThanOrEqualToNegotiation

--- Original
+++ New
@@ @@
     {
         foreach ($class->properties as $property) {
             $types = iterator_to_array($this->filterTypes(...$property->types));
-            if (count($types) <= 0) {
+            if (count($types) > 0) {
                 continue;
             }
             (yield new MultipleRelationDefinition($property->name, ...$types));

52) /var/www/html/src/MappingDefinition/Guesser/PublicPropertyMultipleRelationGuesser.php:17    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
     {
         foreach ($class->properties as $property) {
             $types = iterator_to_array($this->filterTypes(...$property->types));
-            if (count($types) <= 0) {
+            if (count($types) < 0) {
                 continue;
             }
             (yield new MultipleRelationDefinition($property->name, ...$types));

69) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:32    [M] Foreach_

--- Original
+++ New
@@ @@
     {
         $methodCandidates = [];
         /** @var MethodMetadata $method */
-        foreach ($class->methods as $method) {
+        foreach (array() as $method) {
             if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
                 $fieldName = $this->inflector->camelize($matches['fieldName']);
                 if (!$this->isSingular($fieldName)) {

70) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:33    [M] PregMatchMatches

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->methods as $method) {
-            if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
+            if ((int) ($matches = array()) && Type::isOneOf(new ScalarTypeMetadata('bool'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
                 $fieldName = $this->inflector->camelize($matches['fieldName']);
                 if (!$this->isSingular($fieldName)) {
                     continue;

71) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:33    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->methods as $method) {
-            if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
+            if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), $method->returnTypes) || count($method->argumentList->arguments) === 0) {
                 $fieldName = $this->inflector->camelize($matches['fieldName']);
                 if (!$this->isSingular($fieldName)) {
                     continue;

72) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:33    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->methods as $method) {
-            if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
+            if ((preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) || Type::isOneOf(new ScalarTypeMetadata('bool'), $method->returnTypes)) && count($method->argumentList->arguments) === 0) {
                 $fieldName = $this->inflector->camelize($matches['fieldName']);
                 if (!$this->isSingular($fieldName)) {
                     continue;

73) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:35    [M] Identical

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->methods as $method) {
-            if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
+            if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), $method->returnTypes) && count($method->argumentList->arguments) !== 0) {
                 $fieldName = $this->inflector->camelize($matches['fieldName']);
                 if (!$this->isSingular($fieldName)) {
                     continue;

74) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:35    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->methods as $method) {
-            if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
+            if (preg_match('/is(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('bool'), $method->returnTypes) && count($method->argumentList->arguments) === 1) {
                 $fieldName = $this->inflector->camelize($matches['fieldName']);
                 if (!$this->isSingular($fieldName)) {
                     continue;

78) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:46    [M] PregMatchMatches

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$fieldName]['is'] = $method;
             } else {
-                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 1) {
+                if ((int) ($matches = array()) && count($method->argumentList->arguments) === 1) {
                     $action = $matches['action'];
                     $fieldName = $this->inflector->camelize($matches['fieldName']);
                     if (!$this->isSingular($fieldName)) {

79) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:46    [M] LogicalAnd

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$fieldName]['is'] = $method;
             } else {
-                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 1) {
+                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) || count($method->argumentList->arguments) === 1) {
                     $action = $matches['action'];
                     $fieldName = $this->inflector->camelize($matches['fieldName']);
                     if (!$this->isSingular($fieldName)) {

80) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:47    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$fieldName]['is'] = $method;
             } else {
-                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 1) {
+                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 2) {
                     $action = $matches['action'];
                     $fieldName = $this->inflector->camelize($matches['fieldName']);
                     if (!$this->isSingular($fieldName)) {

81) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:47    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$fieldName]['is'] = $method;
             } else {
-                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 1) {
+                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 0) {
                     $action = $matches['action'];
                     $fieldName = $this->inflector->camelize($matches['fieldName']);
                     if (!$this->isSingular($fieldName)) {

82) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:47    [M] Identical

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$fieldName]['is'] = $method;
             } else {
-                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 1) {
+                if (preg_match('/(?<action>set)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) !== 1) {
                     $action = $matches['action'];
                     $fieldName = $this->inflector->camelize($matches['fieldName']);
                     if (!$this->isSingular($fieldName)) {

86) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:59    [M] LogicalAnd

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$fieldName][$action] = $method;
                 } else {
-                    if (preg_match('/(?<action>unset|remove|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 0) {
+                    if (preg_match('/(?<action>unset|remove|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) || count($method->argumentList->arguments) === 0) {
                         $action = $matches['action'];
                         $fieldName = $this->inflector->camelize($matches['fieldName']);
                         if (!$this->isSingular($fieldName)) {

87) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:59    [M] PregMatchMatches

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$fieldName][$action] = $method;
                 } else {
-                    if (preg_match('/(?<action>unset|remove|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 0) {
+                    if ((int) ($matches = array()) && count($method->argumentList->arguments) === 0) {
                         $action = $matches['action'];
                         $fieldName = $this->inflector->camelize($matches['fieldName']);
                         if (!$this->isSingular($fieldName)) {

88) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:60    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$fieldName][$action] = $method;
                 } else {
-                    if (preg_match('/(?<action>unset|remove|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 0) {
+                    if (preg_match('/(?<action>unset|remove|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 1) {
                         $action = $matches['action'];
                         $fieldName = $this->inflector->camelize($matches['fieldName']);
                         if (!$this->isSingular($fieldName)) {

89) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:60    [M] Identical

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$fieldName][$action] = $method;
                 } else {
-                    if (preg_match('/(?<action>unset|remove|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 0) {
+                    if (preg_match('/(?<action>unset|remove|get|has)(?<fieldName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) !== 0) {
                         $action = $matches['action'];
                         $fieldName = $this->inflector->camelize($matches['fieldName']);
                         if (!$this->isSingular($fieldName)) {

101) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:89    [M] Coalesce

--- Original
+++ New
@@ @@
             if (!isset($accessor) && !isset($mutator)) {
                 continue;
             }
-            (yield new VirtualFieldDefinition($fieldName, $accessor, $mutator, $actions['has'] ?? null, $actions['unset'] ?? $actions['remove'] ?? null));
+            (yield new VirtualFieldDefinition($fieldName, $accessor, $mutator, null, $actions['unset'] ?? $actions['remove'] ?? null));
         }
     }
 }

102) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:90    [M] Coalesce

--- Original
+++ New
@@ @@
             if (!isset($accessor) && !isset($mutator)) {
                 continue;
             }
-            (yield new VirtualFieldDefinition($fieldName, $accessor, $mutator, $actions['has'] ?? null, $actions['unset'] ?? $actions['remove'] ?? null));
+            (yield new VirtualFieldDefinition($fieldName, $accessor, $mutator, $actions['has'] ?? null, $actions['unset'] ?? null));
         }
     }
 }

103) /var/www/html/src/MappingDefinition/Guesser/VirtualFieldGuesser.php:90    [M] Coalesce

--- Original
+++ New
@@ @@
             if (!isset($accessor) && !isset($mutator)) {
                 continue;
             }
-            (yield new VirtualFieldDefinition($fieldName, $accessor, $mutator, $actions['has'] ?? null, $actions['unset'] ?? $actions['remove'] ?? null));
+            (yield new VirtualFieldDefinition($fieldName, $accessor, $mutator, $actions['has'] ?? null, $actions['remove'] ?? null));
         }
     }
 }

107) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:39    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->methods as $method) {
-            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 1) {
+            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) || count($method->argumentList->arguments) === 1) {
                 $action = $matches['action'];
                 $relationName = $this->inflector->camelize($matches['relationName']);
                 if (!isset($methodCandidates[$relationName])) {

108) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:39    [M] PregMatchMatches

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->methods as $method) {
-            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 1) {
+            if ((int) ($matches = array()) && count($method->argumentList->arguments) === 1) {
                 $action = $matches['action'];
                 $relationName = $this->inflector->camelize($matches['relationName']);
                 if (!isset($methodCandidates[$relationName])) {

109) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:40    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->methods as $method) {
-            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 1) {
+            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 0) {
                 $action = $matches['action'];
                 $relationName = $this->inflector->camelize($matches['relationName']);
                 if (!isset($methodCandidates[$relationName])) {

110) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:40    [M] Identical

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->methods as $method) {
-            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 1) {
+            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) !== 1) {
                 $action = $matches['action'];
                 $relationName = $this->inflector->camelize($matches['relationName']);
                 if (!isset($methodCandidates[$relationName])) {

111) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:40    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $methodCandidates = [];
         /** @var MethodMetadata $method */
         foreach ($class->methods as $method) {
-            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 1) {
+            if (preg_match('/(?<action>set|remove|add|has)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 2) {
                 $action = $matches['action'];
                 $relationName = $this->inflector->camelize($matches['relationName']);
                 if (!isset($methodCandidates[$relationName])) {

113) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:49    [M] PregMatchMatches

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$relationName][$action] = $method;
             } else {
-                if (preg_match('/(?<action>unset|get)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 0) {
+                if ((int) ($matches = array()) && count($method->argumentList->arguments) === 0) {
                     $action = $matches['action'];
                     $relationName = $this->inflector->camelize($matches['relationName']);
                     if (!isset($methodCandidates[$relationName])) {

114) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:49    [M] LogicalAnd

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$relationName][$action] = $method;
             } else {
-                if (preg_match('/(?<action>unset|get)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 0) {
+                if (preg_match('/(?<action>unset|get)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) || count($method->argumentList->arguments) === 0) {
                     $action = $matches['action'];
                     $relationName = $this->inflector->camelize($matches['relationName']);
                     if (!isset($methodCandidates[$relationName])) {

115) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:50    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$relationName][$action] = $method;
             } else {
-                if (preg_match('/(?<action>unset|get)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 0) {
+                if (preg_match('/(?<action>unset|get)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 1) {
                     $action = $matches['action'];
                     $relationName = $this->inflector->camelize($matches['relationName']);
                     if (!isset($methodCandidates[$relationName])) {
