116) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:50    [M] Identical

--- Original
+++ New
@@ @@
                 }
                 $methodCandidates[$relationName][$action] = $method;
             } else {
-                if (preg_match('/(?<action>unset|get)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) === 0) {
+                if (preg_match('/(?<action>unset|get)(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && count($method->argumentList->arguments) !== 0) {
                     $action = $matches['action'];
                     $relationName = $this->inflector->camelize($matches['relationName']);
                     if (!isset($methodCandidates[$relationName])) {

118) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:59    [M] LogicalAnd

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$relationName][$action] = $method;
                 } else {
-                    if (preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('integer'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
+                    if ((preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) || Type::isOneOf(new ScalarTypeMetadata('integer'), $method->returnTypes)) && count($method->argumentList->arguments) === 0) {
                         $relationName = $this->inflector->camelize($matches['relationName']);
                         if (!isset($methodCandidates[$relationName])) {
                             $methodCandidates[$relationName] = [];

119) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:59    [M] PregMatchMatches

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$relationName][$action] = $method;
                 } else {
-                    if (preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('integer'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
+                    if ((int) ($matches = array()) && Type::isOneOf(new ScalarTypeMetadata('integer'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
                         $relationName = $this->inflector->camelize($matches['relationName']);
                         if (!isset($methodCandidates[$relationName])) {
                             $methodCandidates[$relationName] = [];

120) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:59    [M] LogicalAnd

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$relationName][$action] = $method;
                 } else {
-                    if (preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('integer'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
+                    if (preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('integer'), $method->returnTypes) || count($method->argumentList->arguments) === 0) {
                         $relationName = $this->inflector->camelize($matches['relationName']);
                         if (!isset($methodCandidates[$relationName])) {
                             $methodCandidates[$relationName] = [];

121) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:61    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$relationName][$action] = $method;
                 } else {
-                    if (preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('integer'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
+                    if (preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('integer'), $method->returnTypes) && count($method->argumentList->arguments) === 1) {
                         $relationName = $this->inflector->camelize($matches['relationName']);
                         if (!isset($methodCandidates[$relationName])) {
                             $methodCandidates[$relationName] = [];

122) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:61    [M] Identical

--- Original
+++ New
@@ @@
                     }
                     $methodCandidates[$relationName][$action] = $method;
                 } else {
-                    if (preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('integer'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
+                    if (preg_match('/count(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('integer'), $method->returnTypes) && count($method->argumentList->arguments) !== 0) {
                         $relationName = $this->inflector->camelize($matches['relationName']);
                         if (!isset($methodCandidates[$relationName])) {
                             $methodCandidates[$relationName] = [];

124) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:69    [M] PregMatchMatches

--- Original
+++ New
@@ @@
                         }
                         $methodCandidates[$relationName]['count'] = $method;
                     } else {
-                        if (preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('iterable'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
+                        if ((int) ($matches = array()) && Type::isOneOf(new ScalarTypeMetadata('iterable'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
                             $relationName = $this->inflector->camelize($matches['relationName']);
                             if (!isset($methodCandidates[$relationName])) {
                                 $methodCandidates[$relationName] = [];

125) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:69    [M] LogicalAnd

--- Original
+++ New
@@ @@
                         }
                         $methodCandidates[$relationName]['count'] = $method;
                     } else {
-                        if (preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('iterable'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
+                        if ((preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) || Type::isOneOf(new ScalarTypeMetadata('iterable'), $method->returnTypes)) && count($method->argumentList->arguments) === 0) {
                             $relationName = $this->inflector->camelize($matches['relationName']);
                             if (!isset($methodCandidates[$relationName])) {
                                 $methodCandidates[$relationName] = [];

126) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:69    [M] LogicalAnd

--- Original
+++ New
@@ @@
                         }
                         $methodCandidates[$relationName]['count'] = $method;
                     } else {
-                        if (preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('iterable'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
+                        if (preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('iterable'), $method->returnTypes) || count($method->argumentList->arguments) === 0) {
                             $relationName = $this->inflector->camelize($matches['relationName']);
                             if (!isset($methodCandidates[$relationName])) {
                                 $methodCandidates[$relationName] = [];

127) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:71    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                         }
                         $methodCandidates[$relationName]['count'] = $method;
                     } else {
-                        if (preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('iterable'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
+                        if (preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('iterable'), $method->returnTypes) && count($method->argumentList->arguments) === 1) {
                             $relationName = $this->inflector->camelize($matches['relationName']);
                             if (!isset($methodCandidates[$relationName])) {
                                 $methodCandidates[$relationName] = [];

128) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:71    [M] Identical

--- Original
+++ New
@@ @@
                         }
                         $methodCandidates[$relationName]['count'] = $method;
                     } else {
-                        if (preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('iterable'), $method->returnTypes) && count($method->argumentList->arguments) === 0) {
+                        if (preg_match('/walk(?<relationName>[a-zA-Z_][a-zA-Z0-9_]*)/', $method->name, $matches) && Type::isOneOf(new ScalarTypeMetadata('iterable'), $method->returnTypes) && count($method->argumentList->arguments) !== 0) {
                             $relationName = $this->inflector->camelize($matches['relationName']);
                             if (!isset($methodCandidates[$relationName])) {
                                 $methodCandidates[$relationName] = [];

131) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:86    [M] Coalesce

--- Original
+++ New
@@ @@
         }
         foreach ($methodCandidates as $relationName => $actions) {
             if ($this->isPlural($relationName)) {
-                (yield new VirtualMultipleRelationDefinition($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
+                (yield new VirtualMultipleRelationDefinition($relationName, null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
                 (yield new VirtualUnaryRelationDefinition($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));

132) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:87    [M] Coalesce

--- Original
+++ New
@@ @@
         }
         foreach ($methodCandidates as $relationName => $actions) {
             if ($this->isPlural($relationName)) {
-                (yield new VirtualMultipleRelationDefinition($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
+                (yield new VirtualMultipleRelationDefinition($relationName, $actions['get'] ?? null, null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
                 (yield new VirtualUnaryRelationDefinition($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));

133) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:88    [M] Coalesce

--- Original
+++ New
@@ @@
         }
         foreach ($methodCandidates as $relationName => $actions) {
             if ($this->isPlural($relationName)) {
-                (yield new VirtualMultipleRelationDefinition($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
+                (yield new VirtualMultipleRelationDefinition($relationName, $actions['get'] ?? null, $actions['set'] ?? null, null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
                 (yield new VirtualUnaryRelationDefinition($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));

134) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:89    [M] Coalesce

--- Original
+++ New
@@ @@
         }
         foreach ($methodCandidates as $relationName => $actions) {
             if ($this->isPlural($relationName)) {
-                (yield new VirtualMultipleRelationDefinition($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
+                (yield new VirtualMultipleRelationDefinition($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
                 (yield new VirtualUnaryRelationDefinition($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));

135) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:90    [M] Coalesce

--- Original
+++ New
@@ @@
         }
         foreach ($methodCandidates as $relationName => $actions) {
             if ($this->isPlural($relationName)) {
-                (yield new VirtualMultipleRelationDefinition($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
+                (yield new VirtualMultipleRelationDefinition($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
                 (yield new VirtualUnaryRelationDefinition($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));

136) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:91    [M] Coalesce

--- Original
+++ New
@@ @@
         }
         foreach ($methodCandidates as $relationName => $actions) {
             if ($this->isPlural($relationName)) {
-                (yield new VirtualMultipleRelationDefinition($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
+                (yield new VirtualMultipleRelationDefinition($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, null));
             }
             if ($this->isSingular($relationName)) {
                 (yield new VirtualUnaryRelationDefinition($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));

137) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:97    [M] Coalesce

--- Original
+++ New
@@ @@
                 (yield new VirtualMultipleRelationDefinition($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
-                (yield new VirtualUnaryRelationDefinition($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));
+                (yield new VirtualUnaryRelationDefinition($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));
             }
         }
     }
 }

138) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:97    [M] Coalesce

--- Original
+++ New
@@ @@
                 (yield new VirtualMultipleRelationDefinition($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
-                (yield new VirtualUnaryRelationDefinition($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));
+                (yield new VirtualUnaryRelationDefinition($relationName, $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));
             }
         }
     }
 }

139) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:98    [M] Coalesce

--- Original
+++ New
@@ @@
                 (yield new VirtualMultipleRelationDefinition($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
-                (yield new VirtualUnaryRelationDefinition($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));
+                (yield new VirtualUnaryRelationDefinition($relationName, $actions['get'] ?? $actions['is'] ?? null, null, $actions['has'] ?? null, $actions['unset'] ?? null));
             }
         }
     }
 }

140) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:99    [M] Coalesce

--- Original
+++ New
@@ @@
                 (yield new VirtualMultipleRelationDefinition($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
-                (yield new VirtualUnaryRelationDefinition($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));
+                (yield new VirtualUnaryRelationDefinition($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, null, $actions['unset'] ?? null));
             }
         }
     }
 }

141) /var/www/html/src/MappingDefinition/Guesser/VirtualRelationGuesser.php:100    [M] Coalesce

--- Original
+++ New
@@ @@
                 (yield new VirtualMultipleRelationDefinition($relationName, $actions['get'] ?? null, $actions['set'] ?? null, $actions['add'] ?? null, $actions['remove'] ?? null, $actions['walk'] ?? null, $actions['count'] ?? null));
             }
             if ($this->isSingular($relationName)) {
-                (yield new VirtualUnaryRelationDefinition($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, $actions['unset'] ?? null));
+                (yield new VirtualUnaryRelationDefinition($relationName, $actions['get'] ?? $actions['is'] ?? null, $actions['set'] ?? null, $actions['has'] ?? null, null));
             }
         }
     }
 }

142) /var/www/html/src/MappingDefinition/MappedClassType.php:24    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->fields = [];
         $this->relations = [];
     }
-    public function fields(Field\FieldDefinitionInterface ...$fields) : self
+    protected function fields(Field\FieldDefinitionInterface ...$fields) : self
     {
         foreach ($fields as $field) {
             $this->fields[$field->name] = $field;

144) /var/www/html/src/MappingDefinition/MappedClassType.php:33    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $this;
     }
-    public function relations(Relation\RelationDefinitionInterface ...$relations) : self
+    protected function relations(Relation\RelationDefinitionInterface ...$relations) : self
     {
         foreach ($relations as $relation) {
             $this->relations[$relation->name] = $relation;

146) /var/www/html/src/MappingDefinition/MappedClassType.php:44    [M] CastString

--- Original
+++ New
@@ @@
     }
     public function __toString()
     {
-        return (string) $this->metadata;
+        return $this->metadata;
     }
 }

147) /var/www/html/src/MappingDefinition/MappingIterator.php:68    [M] NewObject

--- Original
+++ New
@@ @@
     }
     public function getChildren()
     {
-        return new self($this->current(), ...$this->builders);
+        new self($this->current(), ...$this->builders);
+        return null;
     }
 }

148) /var/www/html/src/ObjectCompositeMapper.php:18    [M] Foreach_

--- Original
+++ New
@@ @@
     }
     public function __invoke($input, $output)
     {
-        foreach ($this->mappers as $mapper) {
+        foreach (array() as $mapper) {
             $output = $mapper($input, $output);
         }
         return $output;
     }
